#ifndef __SPI_H
#define __SPI_H
//****************************SPI**********************************************
#define		SPI			SPI1            // Используемое устройство
#define         SPI_INPUT               0               // Инициализировать и обрабатывать прием сообщений по каналу от слейвов
#define         SPI_IRQ_DIS             0               // Выключать прерываниея во время исполнения прерывания SPI
//*************************SPI_USER********************************************
#define		SPI_USER_txOk		((uint8_t)0x01)
#define		SPI_USER_rxOk		((uint8_t)0x02)
//***************************GPIO**********************************************
#define         CS_pin          	GPIO_Pin_4      // Пин чип-селекта мастера (Обрабатываеться программно)
#define         SCLK_pin                GPIO_Pin_5      // Пин тактирования (Обрабатываеться аппартано)
#define         MISO_pin                GPIO_Pin_6      // Пин приема (Обрабатываеться аппартано)
#define         MOSI_pin                GPIO_Pin_7      // Пин отправки (Обрабатываеться аппартано)
#define         SPI_port                GPIOA           // Порт SPI
//***************************Define********************************************
#define		SPI_MaxOnLine	        10              // Максимальное кол-во устройств на линии
#define         SPI_BUFFER_SIZE         5               // Размер буфера
#define         SPI_TIMOUT      	0x00FF          // Задержка для тестирования линии
//***************************MACROS********************************************
#define         CS_SET       		SPI_port->BSRR |=  CS_pin
#define         CS_RESET      		SPI_port->BSRR |= (CS_pin << 16)
//****************************Function*****************************************
void    SPI_init(uint8_t bit16);		// Инициализация SPI
void    SPI_Send(uint16_t* data, uint8_t len);	// Отправка сообщения
uint8_t SPI_IsTxEnd(void);			// Запрос окончена ли передача
uint8_t SPI_IsRx(void);			        // Запрос есть ли данные на прием
uint8_t SPI_TestLine(void);		        // Тест линии SPI, подсчет кол-ва устройств на линии
//*****************************************************************************
#endif /*__SPI_H */