#ifndef _BKC_H
#define _BKC_H



//******************************FUNCTIONS***************************************
void BKC_FSA(void);             // Поместить в прерывание пользовательского таймера
void BKC_Init(void);            // Поместить в инициализацию устройства
//*********************************GPIO*****************************************
#define         SCL_pin         GPIO_Pin_10     // I2C2
#define         SDA_pin         GPIO_Pin_11     // I2C2
#define         nINT1_pin       GPIO_Pin_2     
#define         I2C_port        GPIOB

/*
#define         SW_trig_pin     GPIO_Pin_5
#define         SW_port         GPIOA
*/
#define         SW_trig_pin     GPIO_Pin_12
#define         SW_port         GPIOB
//*********************************MACROS***************************************
#define         SwichPressed    (SW_port->IDR & SW_trig_pin)
//******************************************************************************





//******************************************************************************
//*******************************DEVICE*****************************************
//******************************************************************************
#define         I2C_timout              0xFFFFFFFF      // Таймаут ожидания выставления флажков канала
#define         KeyDownTimout           40              // Таймаут нажатия кнопки для отсекания дребезг контактов
//******************************SysReg******************************************
#define         KeyDownOk               0x01            // Кнопка S1 нажата и удержена
#define         DataWriteDone           0x02            // Данные с ключей S2 и S3 записаны в регистры ModBus
#define         Data0Done               0x04            // Раегистр №0 с расшерителя прочитан
#define         Data1Done               0x08            // Раегистр №1 с расшерителя прочитан
//******************************************************************************
//******************************************************************************
//******************************************************************************







//******************************************************************************
//*****************************TCA9535******************************************
//******************************************************************************
#define         TCA_HwAdr               0x40            // Сетевой адрес микросхемы
//*************************Control Register*************************************
#define         InputPort0              0x00            // Чтение порта №0
#define         InputPort1              0x01            // Чтение порта №1
#define         OutputPort0             0x02            // Запись в порт №0
#define         OutputPort1             0x03            // Запись в порт №1
#define         PolarInversPort0        0x04            // Инверсия порта №0
#define         PolarInversPort1        0x05            // Инверсия порта №1
#define         ConfigPort0             0x06            // Чтение/запись порта №0
#define         ConfigPort1             0x07            // Чтение/запись порта №1
//****************************Port Mask*****************************************
#define         S2msk                   0x000F          // Расположение ключа S2 в регистрах расшерителя 
#define         S3msk                   0xFFF0          // Расположение ключа S3 в регистрах расшерителя
//******************************************************************************
//******************************************************************************
//******************************************************************************






//******************************************************************************
//*************************Mod Bus Registers************************************
//******************************************************************************

//*******************************RAM********************************************
#define         ValS2                   0x00            // 0..9         - S2
#define         ValS3                   0x01            // 0..999       - S3
//*******************************ROM********************************************
#define         UpperRangeS2            0x02
#define         UpperRangeS3            0x03
#define         StepS2                  0x04
#define         StepS3                  0x05
#define         RS485Param              0x06


//21032016:
//*******************************ROM********************************************
//...
#define         ValS3_0                 0x01
#define         ValS3_1                 0x02
#define         ValS3_2                 0x03
//...ч

//******************************************************************************
//******************************************************************************
//******************************************************************************

#endif