#ifndef _BKC14_H
#define _BKC14_H
//*******************************INCLUDE****************************************
#include "DIO.h"
//******************************FUNCTIONS***************************************
void BKC14_Init(void);
void BKC14_FSA(void);
//*******************************GPIO*******************************************
#define         SW_trig_pin     GPIO_Pin_12
#define         SW_port         GPIOB

#define         SCL_pin         GPIO_Pin_10     // I2C2
#define         SDA_pin         GPIO_Pin_11     // I2C2
#define         nINT1_pin       GPIO_Pin_2
#define         nINT2_pin       GPIO_Pin_1
#define         nINT3_pin       GPIO_Pin_0
#define         I2C_port        GPIOB
//******************************MACROS******************************************
#define         SW_READ         DIN_READ(SW_port,SW_trig_pin)
//******************************Device******************************************
#define         SwRead          0       // 1 - Считывание крутилок по нажатию кнопки, 0 - непрерывное сканирование
#define         KeyDownTimout   40      // Таймаут нажатия кнопки для отсекания дребезг контактов

#define         DevOnLine       3

#define         SwOnMask        0x01    // Маска бита кнопки в выходном регистре

#define         DevAdr0         0x40
#define         DevAdr1         0x42
#define         DevAdr2         0x46
//******************************************************************************
//*************************Mod Bus Registers************************************
//******************************************************************************

//*******************************RAM********************************************
#define         RamNum                  6

#define         ValS1_1                 0x00    // 0-9
#define         ValS1_2                 0x01    // 0-999
#define         ValS2_1                 0x02    // 0-9
#define         ValS2_2                 0x03    // 0-999
#define         ValS3_1                 0x04    // 0-9
#define         ValS3_2                 0x05    // 0-999
#define         SwAdr                   0x06    // 0..1
//*******************************ROM********************************************

//******************************************************************************
//******************************************************************************
//******************************************************************************
#endif